{
  "comics": [
    {
      "id": "1",
      "slug": "omega-world",
      "name": "Omega World",
      "description": "Worried about the situation in which the mutants are, Storm talks with Logan to try and distract herself. In the middle of their conversation, they are interrupted by Forge, who reports that Cerebra detected the sudden appearance of six hundred new mutant signatures in Tokyo. With most of her team on missions throughout the world, Storm agrees to send Colossus and the team of young mutants he has been training - composed of Anole, Ernst, Glob, and No-Girl - to investigate.Once in Tokyo, Cerebra takes the X-Men to the warehouse from where the mutant signatures were coming only to discover it serves as base for Sugar Man, who proceeds to use his ability to control his own bio-mass to attack Cerebra. Cerebra tells Colossus the mutant signatures are coming from the orb that is on the machine Sugar Man was operating, prompting the villain to reveal it contains mutant embryos he genetically engineered in total isolation from the Terrigen Mists, which he planned to send somewhere safe so he could raise them and become their leader. However, as Sugar Man and Cerebra fight, the machine activates itself and teleports Colossus and his team. Storm and the rest of the X-Men soon arrive and confront Sugar Man. Young Jean Grey uses her powers to discover where Sugar Man sent Colossus and his team, finding out they were sent to the future. Forge reverse engineers Sugar Man's time-travel tech and uses Cerebra to follow them.Arriving a thousand years into Earth's future, the X-Men find Colossus' team, albeit somewhat different. They reveal that they had arrived some time before Storm and her team. When Nightcrawler asks them what became of Colossus, the team is attacked and are shocked to see who attacked them: Colossus and his fellow Horsemen of Apocalypse.",
      "issueNumber": "1",
      "pages": "20",
      "price": "10.00",
      "releaseDate": "2014-03-14T12:47:45-0400",
      "image": "http://comics.panini.it/store/media/catalog/product/cache/80/small_image/9df78eab33525d08d6e5fb8d27136e95/M/O/MOMIG012ISBN_0.jpg",
      "characters": []
    },
    {
      "id": "2",
      "slug": "Ant-Man",
      "name": "Ant-Man (2003) #1",
      "description": "Size does matter.  And no one knows this more than Hank Pym - a.k.a. Ant-Man. Got a problem with Galactus? Call the FF. Got a problem with, say, mind-controlled cockroaches? Then Ant-Man's your man! And needless to say, it's done a number on our diminutive hero's self-esteem.  When Ant-Man is tapped to infiltrate an international spy ring that has been siphoning secrets out of Washington, he jumps at the chance - unaware that he's being used as a pawn in a larger game of espionage.",
      "issueNumber": "2",
      "pages": "21",
      "price": "15.50",
      "releaseDate": "2015-03-14T12:47:45-0400",
      "image": "https://rukminim1.flixcart.com/image/704/704/jqo3b0w0/poster/k/4/h/medium-movmcu0502-official-ant-man-all-characters-in-ant-hole-original-imafcmhdhp4nsqan.jpeg?q=70",
      "characters": [
        {
          "id": "1",
          "name": "BEAST",
          "description": "Henry 'HANK' McCoy was born and raised in Dunfee, Illinois, the son of Norton and Edna McCoy. His father worked at a nuclear power plant where he was exposed to massive amounts of radiation during an accident. Norton was completely unharmed, but the radiation affected his genes and, as a result, his son was born a mutant. Unlike most mutants, Henry showed signs of mutation from birth:[10] unusually large hands and feet, coupled with unusual strength and agility. A prodigy, Hank was also endowed with an innate superhuman intellect and during adolescence further increased his powers of simian-like augmented agility, reflexes, and strength.[11]",
          "numberOfRoles": "2500",
          "isGood": "true",
          "image": "https://images-na.ssl-images-amazon.com/images/I/61gSRiYJznL._SX328_BO1,204,203,200_.jpg"
        },
        {
          "id": "2",
          "name": "Magik",
          "description": "Illyana Nikolievna Rasputina (Russian: Ильяна Николаевна Распутина) was born on the Soviet collective farm called the Ust-Ordynsky Collective, near Lake Baikal, in Siberia. She was the youngest of three mutant siblings. Illyana's brothers were the X-Man Piotr (Colossus), and the cosmonaut, Mikhail Rasputin. As a child, she was saved by Piotr from a runaway tractor, just before her brother was recruited into the X-Men by ",
          "numberOfRoles": "1999",
          "isGood": "true",
          "image": "https://images-na.ssl-images-amazon.com/images/I/61enOChflWL._SY445_.jpg"
        },
        {
          "id": "3",
          "name": "Dr Strange",
          "description": "Stephen Strange was born to Eugene and Beverly Strange in November[9] 1930 while the couple was vacationing in Philadelphia. In 1932 Stephen's sister Donna was born at the family's Nebraska farm. Knowing that Strange was destined to become the next Sorcerer Supreme, a resentful apprentice sorcerer, Karl Mordo, beset the child with demons from the age of eight through to adulthood, as he was jealous that a kid would be better than him. Ultimately Strange was rescued by Mordo's master, the Ancient One, mystic protector of the Earth-realm as the then-current Sorcerer Supreme. A year or two after this torment began, Stephen's brother, Victor, was born. At age eleven Strange aided an injured Donna, an experience which ultimately fostered an interest in medicine. Strange entered New York College as a pre-med student directly out of high school. Later, while home on vacation for his nineteenth birthday, Strange was swimming with Donna when she suffered a cramp. After a frantic search, Stephen found her already drowned. The experience left him with a sense of personal failure that eroded his medical idealism",
          "numberOfRoles": "440",
          "isGood": "true",
          "image": "https://imgc.allpostersimages.com/img/print/u-g-Q1BXGAG0.jpg?w=550&h=550&p=0"
        }
      ]
    },
    {
      "id": "3",
      "slug": "Ultimate-X-Men-Vol-5",
      "name": "Ultimate X-Men Vol. 5: Ultimate War",
      "description": "The Ultimates vs. the Ultimate X-Men: the battle begins. When the X-Men do the worst thing they could to humanity, the government orders Captain America, Iron Man, Thor and the rest of the Ultimates to bring them down. A small but lethal army, the Ultimates were created to face these and other newly rising threats to mankind. But the X-Men's founder, Professor X, hasn't been training his students for nothing -- and the youngs mutants just might take out the Ultimates first.",
      "issueNumber": "1",
      "pages": "21",
      "price": "16.50",
      "releaseDate": "2010-03-14T12:47:45-0400",
      "image": "https://images-na.ssl-images-amazon.com/images/S/cmx-images-prod/Item/6764/MAR041664._SX360_QL80_TTD_.jpg",
      "characters": [
        {
          "id": "8",
          "name": "Nightcrawler",
          "description": "In the form of a German noblewoman, the shape-shifting mutant Mystique married Baron Christian Wagner. Meanwhile, Mystique had an affair with the mysterious Azazel from La Isla des Demonas and became pregnant with their child. Azazel told Mystique to raise their child as if it were the Count's. A heartbroken Raven agreed and, while Christian did become suspicious as to the baby's paternity, his sudden 'accidental' death ensured no one else heard his suspicions. The baby was born visibly mutated with blue fur all over, pointed ears, iridescent eyes, and a prehensile tail. Due to the shock and the strain of the boy’s difficult delivery, Mystique lost concentration and accidentally revealed her true form. Word spread of her and the baby's condition and mother and son were chased by a torch-wielding angry mob. Mystique passed out and left young Kurt Wagner floating down a river during her escape.",
          "numberOfRoles": "1000",
          "isGood": "true",
          "image": "https://i.annihil.us/u/prod/marvel/i/mg/c/e0/5cd9caf467f43/clean.jpg"
        },
        {
          "id": "9",
          "name": "Logan",
          "description": "This Logan's life was originally thought to be identical to that of the primary iteration of the Wolverine; however, there has been new evidence released contradicting this, such as the fact that he recalled fighting in the War of 1812[8] while the Logan of Earth-616 was allegedly born during the 1880s.[9] Like his Earth-616 counterpart, Logan seems to have experienced the same Weapon X experiment that laced his skeleton with Adamantium",
          "numberOfRoles": "1000",
          "isGood": "true",
          "image": "https://vignette.wikia.nocookie.net/marveldatabase/images/3/3d/Logan_%28film%29_poster_003.jpg/revision/latest/scale-to-width-down/338?cb=20170127090323"
        },
        {
          "id": "10",
          "name": "Storm",
          "description": "Years later, Ororo found herself in the Savage Land and was forced to battle the threat of a mutant energy manipulator, who used Ororo's control over weather, known as Deluge, who sought revenge against humanity. With the help of the team of mutant heroes known as the X-Men, Deluge was seemingly destroyed and Ororo returned to her life among the tribal people",
          "numberOfRoles": "10000",
          "isGood": "true",
          "images": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f9/X-Men_Storm_Main.png/250px-X-Men_Storm_Main.png"
        },
        {
          "id": "11",
          "name": "Colossus",
          "description": "After a transformed Piotr rescued his sister Illyana from a runaway tractor, he was contacted by Professor Charles Xavier, founder of the X-Men, when Professor Xavier was organising a new team of mutant X-Men to help him rescue the original X-Men from the sentient island of Krakoa. Piotr agreed to leave the farm community in which he had been born and raised to go to America with Professor Xavier and stay at his School for Gifted Youngsters. Professor Xavier gave Piotr the code name 'Colossus' and Piotr aided Professor Xavier's other new recruits in their battle against Krakoa.[3] After the battle was won, most of the original X-Men left the team. The newly christened Colossus remained in the United States with the new X-Men, Storm, Nightcrawler, Wolverine, Thunderbird, and Banshee, while the rest of his family stayed on the farm. The second group of X-Men were mostly adults and required no tutoring from Professor X, but were trained in the use of their powers and how to use them in tandem as a team, in the Danger Room.",
          "numberOfRoles": "1070",
          "isGood": "true",
          "image": "https://vignette.wikia.nocookie.net/deathbattlefanon/images/5/54/Colossus_Portrait_Art.png/revision/latest/scale-to-width-down/300?cb=20160214210531"
        },
        {
          "id": "12",
          "name": "IceMan",
          "description": "Xavier sent Scott Summers (Cyclops) to recruit Bobby. After Bobby turned him down, the two mutants got into a brief scuffle before the mob caught up with them. The mob was stringing Scott and Bobby up to be hanged when Professor X used his telepathic abilities to erase their memories. Grateful for saving his life and yearning to be like Scott,[13] Bobby enrolled in Xavier's School for Gifted Youngsters and become the second member of the X-Men.[14] There, the X-Men were tutored by Professor X and trained in the use of their powers in the Danger Room. As 'Iceman', Bobby learned to control his abilities in order to protect a world that feared and hated him for being different alongside Cyclops, Angel, Beast, and Marvel Girl.",
          "numberOfRoles": "100200",
          "isGood": "true",
          "image": "https://upload.wikimedia.org/wikipedia/en/a/ad/Iceman_%28Bobby_Drake%29.png"
        },
        {
          "id": "13",
          "name": "Lockjaw",
          "description": "he massive dog known as Lockjaw is the loyal pet of the Royal Family of the Inhumans, an offshoot of humanity that was genetically altered by the Kree centuries ago whose isolation in the hidden city of Attilan resulted in the development of a high technological society with a focus on genetics.[8] He was born from the Inhumans' experimentation on canines,[3] his mother had been brought to Attilan as a puppy and experimented on by the Surgeon Supreme. She was impregnated by her own cloned genetic material and gestated 5 puppies with the purpose of performing terrigenesis in the womb. Lockjaw was successfully mutated, while his siblings were not, and before the Surgeon could remove them from the womb for further experimentation he teleported his siblings to four different locations: Brooklyn, the Savage Land, Wundagore Mountain and Earth-8311 before returning and appearing to be the only baby born. [9] He shares a particular bond with Black Bolt, the most recurring ruler of the Inhumans, and Crystal. He is regularly used as transportation to traverse between time and space.",
          "numberOfRoles": "100",
          "isGood": "false",
          "image": "https://vignette.wikia.nocookie.net/marveldatabase/images/5/51/Lockjaw_Vol_1_1_Textless.jpg/revision/latest/scale-to-width-down/335?cb=20171122020841"
        },
        {
          "id": "14",
          "name": "Magneto",
          "description": "Professor Xavier's original team of X-Men thwarted Magneto's first act of genetic terrorism in his war with humanity, the takeover of the Cape Citadel missile base.[11] When they next clashed, Magneto overthrew the government of Santo Marco, setting himself up as absolute ruler, and was leading his original Brotherhood of Evil Mutants,[12] which included Wanda and Pietro, now known as the Scarlet Witch and Quicksilver. Not until years later would Magneto learn that they were actually his children. After the X-Men liberated Santo Marco, Magneto kidnapped Angel and the X-Men followed to Asteroid M. Asteroid M was destroyed in the battle with the X-Men, when Scarlet Witch sabotaged a button, designed to kill the X-Men",
          "numberOfRoles": "100000",
          "isGood": "true",
          "image": "https://vignette.wikia.nocookie.net/marvelvscapcom/images/5/5e/Magneto.png/revision/latest/scale-to-width-down/317?cb=20110720195237"
        }
      ]
    },
    {
      "id": "4",
      "slug": "X-Men-Days-of-Future-Past",
      "name": "X-Men: Days of Future Past",
      "description": "Re-live the legendary first journey into the dystopian future of 2013 - where Sentinels stalk the Earth, and the X-Men are humanity's only hope...until they die! Also featuring the first appearance of Alpha Flight, the return of the Wendigo, the history of the X-Men from Cyclops himself...and a demon for Christmas!",
      "issueNumber": "4",
      "pages": "288",
      "price": "50.50",
      "releaseDate": "2010-03-11T12:47:45-0400",
      "image": "https://m.media-amazon.com/images/M/MV5BZGIzNWYzN2YtMjcwYS00YjQ3LWI2NjMtOTNiYTUyYjE2MGNkXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg",
      "characters": [
        {
          "id": "8",
          "name": "Nightcrawler",
          "description": "In the form of a German noblewoman, the shape-shifting mutant Mystique married Baron Christian Wagner. Meanwhile, Mystique had an affair with the mysterious Azazel from La Isla des Demonas and became pregnant with their child. Azazel told Mystique to raise their child as if it were the Count's. A heartbroken Raven agreed and, while Christian did become suspicious as to the baby's paternity, his sudden 'accidental' death ensured no one else heard his suspicions. The baby was born visibly mutated with blue fur all over, pointed ears, iridescent eyes, and a prehensile tail. Due to the shock and the strain of the boy’s difficult delivery, Mystique lost concentration and accidentally revealed her true form. Word spread of her and the baby's condition and mother and son were chased by a torch-wielding angry mob. Mystique passed out and left young Kurt Wagner floating down a river during her escape.",
          "numberOfRoles": "1000",
          "isGood": "true",
          "image": "https://i.annihil.us/u/prod/marvel/i/mg/c/e0/5cd9caf467f43/clean.jpg"
        },
        {
          "id": "9",
          "name": "Logan",
          "description": "This Logan's life was originally thought to be identical to that of the primary iteration of the Wolverine; however, there has been new evidence released contradicting this, such as the fact that he recalled fighting in the War of 1812[8] while the Logan of Earth-616 was allegedly born during the 1880s.[9] Like his Earth-616 counterpart, Logan seems to have experienced the same Weapon X experiment that laced his skeleton with Adamantium",
          "numberOfRoles": "1000",
          "isGood": "true",
          "image": "https://vignette.wikia.nocookie.net/marveldatabase/images/3/3d/Logan_%28film%29_poster_003.jpg/revision/latest/scale-to-width-down/338?cb=20170127090323"
        },
        {
          "id": "10",
          "name": "Storm",
          "description": "Years later, Ororo found herself in the Savage Land and was forced to battle the threat of a mutant energy manipulator, who used Ororo's control over weather, known as Deluge, who sought revenge against humanity. With the help of the team of mutant heroes known as the X-Men, Deluge was seemingly destroyed and Ororo returned to her life among the tribal people",
          "numberOfRoles": "10000",
          "isGood": "true",
          "images": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f9/X-Men_Storm_Main.png/250px-X-Men_Storm_Main.png"
        },
        {
          "id": "11",
          "name": "Colossus",
          "description": "After a transformed Piotr rescued his sister Illyana from a runaway tractor, he was contacted by Professor Charles Xavier, founder of the X-Men, when Professor Xavier was organising a new team of mutant X-Men to help him rescue the original X-Men from the sentient island of Krakoa. Piotr agreed to leave the farm community in which he had been born and raised to go to America with Professor Xavier and stay at his School for Gifted Youngsters. Professor Xavier gave Piotr the code name 'Colossus' and Piotr aided Professor Xavier's other new recruits in their battle against Krakoa.[3] After the battle was won, most of the original X-Men left the team. The newly christened Colossus remained in the United States with the new X-Men, Storm, Nightcrawler, Wolverine, Thunderbird, and Banshee, while the rest of his family stayed on the farm. The second group of X-Men were mostly adults and required no tutoring from Professor X, but were trained in the use of their powers and how to use them in tandem as a team, in the Danger Room.",
          "numberOfRoles": "1070",
          "isGood": "true",
          "image": "https://vignette.wikia.nocookie.net/deathbattlefanon/images/5/54/Colossus_Portrait_Art.png/revision/latest/scale-to-width-down/300?cb=20160214210531"
        },
        {
          "id": "12",
          "name": "IceMan",
          "description": "Xavier sent Scott Summers (Cyclops) to recruit Bobby. After Bobby turned him down, the two mutants got into a brief scuffle before the mob caught up with them. The mob was stringing Scott and Bobby up to be hanged when Professor X used his telepathic abilities to erase their memories. Grateful for saving his life and yearning to be like Scott,[13] Bobby enrolled in Xavier's School for Gifted Youngsters and become the second member of the X-Men.[14] There, the X-Men were tutored by Professor X and trained in the use of their powers in the Danger Room. As 'Iceman', Bobby learned to control his abilities in order to protect a world that feared and hated him for being different alongside Cyclops, Angel, Beast, and Marvel Girl.",
          "numberOfRoles": "100200",
          "isGood": "true",
          "image": "https://upload.wikimedia.org/wikipedia/en/a/ad/Iceman_%28Bobby_Drake%29.png"
        },
        {
          "id": "13",
          "name": "Lockjaw",
          "description": "he massive dog known as Lockjaw is the loyal pet of the Royal Family of the Inhumans, an offshoot of humanity that was genetically altered by the Kree centuries ago whose isolation in the hidden city of Attilan resulted in the development of a high technological society with a focus on genetics.[8] He was born from the Inhumans' experimentation on canines,[3] his mother had been brought to Attilan as a puppy and experimented on by the Surgeon Supreme. She was impregnated by her own cloned genetic material and gestated 5 puppies with the purpose of performing terrigenesis in the womb. Lockjaw was successfully mutated, while his siblings were not, and before the Surgeon could remove them from the womb for further experimentation he teleported his siblings to four different locations: Brooklyn, the Savage Land, Wundagore Mountain and Earth-8311 before returning and appearing to be the only baby born. [9] He shares a particular bond with Black Bolt, the most recurring ruler of the Inhumans, and Crystal. He is regularly used as transportation to traverse between time and space.",
          "numberOfRoles": "100",
          "isGood": "false",
          "image": "https://vignette.wikia.nocookie.net/marveldatabase/images/5/51/Lockjaw_Vol_1_1_Textless.jpg/revision/latest/scale-to-width-down/335?cb=20171122020841"
        },
        {
          "id": "14",
          "name": "Magneto",
          "description": "Professor Xavier's original team of X-Men thwarted Magneto's first act of genetic terrorism in his war with humanity, the takeover of the Cape Citadel missile base.[11] When they next clashed, Magneto overthrew the government of Santo Marco, setting himself up as absolute ruler, and was leading his original Brotherhood of Evil Mutants,[12] which included Wanda and Pietro, now known as the Scarlet Witch and Quicksilver. Not until years later would Magneto learn that they were actually his children. After the X-Men liberated Santo Marco, Magneto kidnapped Angel and the X-Men followed to Asteroid M. Asteroid M was destroyed in the battle with the X-Men, when Scarlet Witch sabotaged a button, designed to kill the X-Men",
          "numberOfRoles": "100000",
          "isGood": "true",
          "image": "https://vignette.wikia.nocookie.net/marvelvscapcom/images/5/5e/Magneto.png/revision/latest/scale-to-width-down/317?cb=20110720195237"
        },
        {
          "id": "1",
          "name": "BEAST",
          "description": "Henry 'HANK' McCoy was born and raised in Dunfee, Illinois, the son of Norton and Edna McCoy. His father worked at a nuclear power plant where he was exposed to massive amounts of radiation during an accident. Norton was completely unharmed, but the radiation affected his genes and, as a result, his son was born a mutant. Unlike most mutants, Henry showed signs of mutation from birth:[10] unusually large hands and feet, coupled with unusual strength and agility. A prodigy, Hank was also endowed with an innate superhuman intellect and during adolescence further increased his powers of simian-like augmented agility, reflexes, and strength.[11]",
          "numberOfRoles": "2500",
          "isGood": "true",
          "image": "https://images-na.ssl-images-amazon.com/images/I/61gSRiYJznL._SX328_BO1,204,203,200_.jpg"
        },
        {
          "id": "2",
          "name": "Magik",
          "description": "Illyana Nikolievna Rasputina (Russian: Ильяна Николаевна Распутина) was born on the Soviet collective farm called the Ust-Ordynsky Collective, near Lake Baikal, in Siberia. She was the youngest of three mutant siblings. Illyana's brothers were the X-Man Piotr (Colossus), and the cosmonaut, Mikhail Rasputin. As a child, she was saved by Piotr from a runaway tractor, just before her brother was recruited into the X-Men by ",
          "numberOfRoles": "1999",
          "isGood": "true",
          "image": "https://images-na.ssl-images-amazon.com/images/I/61enOChflWL._SY445_.jpg"
        },
        {
          "id": "3",
          "name": "Dr Strange",
          "description": "Stephen Strange was born to Eugene and Beverly Strange in November[9] 1930 while the couple was vacationing in Philadelphia. In 1932 Stephen's sister Donna was born at the family's Nebraska farm. Knowing that Strange was destined to become the next Sorcerer Supreme, a resentful apprentice sorcerer, Karl Mordo, beset the child with demons from the age of eight through to adulthood, as he was jealous that a kid would be better than him. Ultimately Strange was rescued by Mordo's master, the Ancient One, mystic protector of the Earth-realm as the then-current Sorcerer Supreme. A year or two after this torment began, Stephen's brother, Victor, was born. At age eleven Strange aided an injured Donna, an experience which ultimately fostered an interest in medicine. Strange entered New York College as a pre-med student directly out of high school. Later, while home on vacation for his nineteenth birthday, Strange was swimming with Donna when she suffered a cramp. After a frantic search, Stephen found her already drowned. The experience left him with a sense of personal failure that eroded his medical idealism",
          "numberOfRoles": "440",
          "isGood": "true",
          "image": "https://imgc.allpostersimages.com/img/print/u-g-Q1BXGAG0.jpg?w=550&h=550&p=0"
        },
        {
          "id": "4",
          "name": "World Eater",
          "description": "The World-Eater was a powerful creature that fed off dimensions, using a host native to its desired dimension in order to consume it before jumping to the next through the Lattice.When the World-Eater took interest in the demonic dimension called Limbo, it chose the mutant known as Magik to be its host and tried to get to her through her student, Sapna. However, its presence inside Sapna's mind was soon discovered by Doctor Strange, who was helping Magik and Sapna learn more about the young girl's powers. The World-Eater attacked them, but was banished by a spell cast by Sapna.Some time later, the World-Eater took advantage of Sapna's vulnerability to lure her away from Limbo while Magik was helping the X-Men in the future,[4] and possessed her. After stealing Magik's Soulsword and trapping her, alonside Storm, in another dimension, the World-Eater went to Limbo to finally consume it.[5] However, with the help of the Magical Resistance, a group formed by the last survivors of some of the many dimensions destroyed by the World-Eater, Magik managed to return to her realm and destroy the entity by killing Sapna",
          "numberOfRoles": "20",
          "isGood": "true",
          "image": "https://lh3.googleusercontent.com/VfUkgIDk8MT2EngFZhHDUsJNm3RW69gfL7HHbCSZejcSvjRON78dFMIN9ypeYds2_VLsY2mKZZDcm2xnUHBVB14VFn_Z_SX75-hgcOhWpBHryBB67A3ovIxY3HbXsdGHjA=s412"
        },
        {
          "id": "5",
          "name": "Deadpool",
          "description": "At some point after the return of Apocalypse in the early twenty-first century, Deadpool became one of his Horsemen.Along with the other Horsemen of Apocalypse, Deadpool attacked Colossus and his team of young X-Men when they ended up on Omega World, but only Colossus was subdued as the other mutants managed to escape with an ark containing six hundred mutant embryos in their possession.[1] Later, Deadpool and the Horsemen of Apocalypse - now with Colossus among them - tracked down the young X-Men, which led to their battle against them and a team of X-Men led by Storm.[2] The X-Men were ultimately defeated and the ark taken by the Horsemen to their master.[3]When the X-Men invaded Apocalypse's Kingdom to try to retrieve the ark, Deadpool and the Horsemen of Apocalypse ambushed them.[3] Deadpool fought Iceman and had his mask partially torn by him, exposing his stitched lips underneath it. Using one of his swords, Deadpool cut the sutures off and threw up a swarm of insects on Iceman, seemingly defeating him.[4]Deadpool was taken down by Cerebra when he tried to escape Apocalypse's domain while Omega World was crumbling. Deadpool presumably perished along with the other inhabitants of Omega World when it collapsed",
          "numberOfRoles": "2001",
          "isGood": "true",
          "image": "https://cdn10.bigcommerce.com/s-vzuks4/products/433/images/4599/Deadpool__82735.1535990058.590.885.jpg?c=2"
        },
        {
          "id": "6",
          "name": "Spider Man",
          "description": "hile attending a public exhibition demonstrating the safe handling of nuclear laboratory waste materials, sponsored by the General Techtronics Corporation, the 15-year-old Peter Parker was bitten on the hand by a spider that had been irradiated by a particle accelerator used in the demonstration. Unbeknownst to him, after the spider fell from his hand, it bit a girl, Cindy Moon on the ankle before it died from the radiation.[47] Making his way home afterwards, Peter was almost hit by a car; when Peter jumped out of the way, Peter discovered he had somehow gained incredible strength, agility, and the ability to cling to walls, spider-like traits that he immediately associated with the spider bite.[2]",
          "numberOfRoles": "20000",
          "isGood": "true",
          "image": "https://images-na.ssl-images-amazon.com/images/I/A1CcbJfKqJL._SY679_.jpg"
        },
        {
          "id": "7",
          "name": "War",
          "description": "Piotr Nikolaievitch Rasputin (Russian: Пётр 'итер' Николаевич Распутин) was born on the Soviet collective farm, called the Ust-Ordynski Collective, near Lake Baikal in Siberia. Piotr grew up with his dear brother, the famous cosmonaut Mikhail Rasputin, and his beloved younger sister, Illyana Rasputina and would pass the time drawing or painting, a hobby he was immensely talented in. Piotr's superhuman powers emerged at the age of 13. At first, he was content simply to use these powers to aid his family and the other people of the Collective",
          "numberOfRoles": "1999",
          "isGood": "true",
          "image": "https://vignette.wikia.nocookie.net/mkwikia/images/0/09/Kratos123.png/revision/latest?cb=20140417115334"
        }
      ]
    },
    {
      "id": "5",
      "slug": "Sentry-the",
      "name": "Sentry, the",
      "description": "On the edge of alcoholism and a failed marriage, Bob Reynolds wakes up to discover his true nature. A forgotten hero, he must unravel the conspiracy to erase his memory from mankind before an evil entity returns.",
      "issueNumber": "10",
      "pages": "21",
      "price": "19.50",
      "releaseDate": "1960-03-11T12:47:45-0400",
      "image": "https://vignette.wikia.nocookie.net/marveldatabase/images/6/60/Sentry_Vol_3_1_Textless.jpg/revision/latest?cb=20180320215750",
      "characters": [
        {
          "id": "6",
          "name": "Spider Man",
          "description": "hile attending a public exhibition demonstrating the safe handling of nuclear laboratory waste materials, sponsored by the General Techtronics Corporation, the 15-year-old Peter Parker was bitten on the hand by a spider that had been irradiated by a particle accelerator used in the demonstration. Unbeknownst to him, after the spider fell from his hand, it bit a girl, Cindy Moon on the ankle before it died from the radiation.[47] Making his way home afterwards, Peter was almost hit by a car; when Peter jumped out of the way, Peter discovered he had somehow gained incredible strength, agility, and the ability to cling to walls, spider-like traits that he immediately associated with the spider bite.[2]",
          "numberOfRoles": "20000",
          "isGood": "true",
          "image": "https://images-na.ssl-images-amazon.com/images/I/A1CcbJfKqJL._SY679_.jpg"
        },
        {
          "id": "7",
          "name": "War",
          "description": "Piotr Nikolaievitch Rasputin (Russian: Пётр 'итер' Николаевич Распутин) was born on the Soviet collective farm, called the Ust-Ordynski Collective, near Lake Baikal in Siberia. Piotr grew up with his dear brother, the famous cosmonaut Mikhail Rasputin, and his beloved younger sister, Illyana Rasputina and would pass the time drawing or painting, a hobby he was immensely talented in. Piotr's superhuman powers emerged at the age of 13. At first, he was content simply to use these powers to aid his family and the other people of the Collective",
          "numberOfRoles": "1999",
          "isGood": "true",
          "image": "https://vignette.wikia.nocookie.net/mkwikia/images/0/09/Kratos123.png/revision/latest?cb=20140417115334"
        }
      ]
    }
  ]
}